---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionWrongType
source: html/a2807272-d9f8-bb3b-4378-9bb68360afcc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures.StructuralCustomConnectionWrongType Property

Structural Custom Connection has an inappropriate type assigned.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralCustomConnectionWrongType { get; }
```